In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv("carprices.csv")

In [3]:
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car Model      13 non-null     object
 1   Mileage        13 non-null     int64
 2   Sell Price($)  13 non-null     int64
 3   Age(yrs)       13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 544.0+ bytes

In [5]:
x=df[["Car Model","Mileage","Age(yrs)"]]
x

                Car Model  Mileage  Age(yrs)
0                  BMW X5    69000         6
1                  BMW X5    35000         3
2                  BMW X5    57000         5
3                  BMW X5    22500         2
4                  BMW X5    46000         4
5                 Audi A5    59000         5
6                 Audi A5    52000         5
7                 Audi A5    72000         6
8                 Audi A5    91000         8
9   Mercedez Benz C class    67000         6
10  Mercedez Benz C class    83000         7
11  Mercedez Benz C class    79000         7
12  Mercedez Benz C class    59000         5

In [6]:
y=df["Sell Price($)"]
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
x["Car Model"]=le.fit_transform(x["Car Model"])

In [8]:
le.classes_

array(['Audi A5', 'BMW X5', 'Mercedez Benz C class'], dtype=object)

In [9]:
# Step1:- import model

from sklearn.linear_model import LinearRegression

# Step2:- initilize a model

lr=LinearRegression()

# Step3:- Train a model

lr.fit(x,y)

# Step4:- Prediction

y_pred=lr.predict(x)

In [10]:
from sklearn.metrics import r2_score,mean_absolute_error,mean_squared_error
print("r2 :",r2_score(y,y_pred))
print("mae :",mean_absolute_error(y,y_pred))
print("mse :",mean_squared_error(y,y_pred))
print("rmse :",np.sqrt(mean_squared_error(y,y_pred)))

r2 : 0.8719970367825953
mae : 2295.287900982037
mse : 7568943.975422336
rmse : 2751.1713824155586

In [11]:
lr.coef_

array([ 1.10167257e+03, -4.11783314e-01,  2.51585847e+02])

In [12]:
lr.intercept_

48657.33279488054